def direction(facing, turn):
    if type(turn) != int:                                   #Перевірка на тип
      return (print("Error in turn. Type int required"))    #Вивід помилки при іншому типу даних
    if -1080 <= turn <= 1080:                               #Спочатку перевіримо чи відповідають введені дані граничним умовам
        f = ["N", "NE", "E", "SE", "S", "SW", "W", "NW"]    #Створимо список із значеннями направлень
        if facing in f:                                     #Перевіримо чи відповідають введені дані можливим значенням
            num = turn // 45                                #Визначимо, скільки здвигів потрібно зробити
            step = num % len(f)                             #Визначимо кількість кроків для отримання потрібної позиції (кожні 8 здвигів - це одне проходження по колу(списку))
            new_pos = step+f.index(facing)-len(f)           #Визначаємо кінцеву позицію
        else:                                               
            return (print("Error in start position. Value must be N, NE, E, SE, S, SW, W, NW")) #Обробка помилки в написанні стартової позиції
    elif -1080>turn>1080:                                   #Обробка помилки при введенні значень поза діапазоном
        return (print("Error!!! turn must be between -1080 and 1080"))  #Виводимо помилку
   
    return f[new_pos]                                       #Повернення результату
    
